<!DOCTYPE html><html lang="zh-CN" data-theme="light"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width,initial-scale=1"><title>逆向工程核心原理——反调试技术 | Whitebird's Home</title><meta name="keywords" content="Reverse"><meta name="author" content="Whitebird"><meta name="copyright" content="Whitebird"><meta name="format-detection" content="telephone=no"><meta name="theme-color" content="#ffffff"><meta name="description" content="动态反调试技术与静态反调试技术的学习笔记">
<meta property="og:type" content="article">
<meta property="og:title" content="逆向工程核心原理——反调试技术">
<meta property="og:url" content="https://whitebird0.github.io/post/%E5%8F%8D%E8%B0%83%E8%AF%95%E6%8A%80%E6%9C%AF.html">
<meta property="og:site_name" content="Whitebird&#39;s Home">
<meta property="og:description" content="动态反调试技术与静态反调试技术的学习笔记">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://img-blog.csdnimg.cn/ef024c421e8e459fb166cbbd1f3046d7.png?x-oss-process=image/watermark,type_ZHJvaWRzYW5zZmFsbGJhY2s,shadow_50,text_Q1NETiBAV2hpdGViaXJkXw==,size_20,color_FFFFFF,t_70,g_se,x_16#pic_center">
<meta property="article:published_time" content="2022-03-28T02:30:21.000Z">
<meta property="article:modified_time" content="2022-03-28T09:54:49.013Z">
<meta property="article:author" content="Whitebird">
<meta property="article:tag" content="Reverse">
<meta name="twitter:card" content="summary">

    })(window)</script><meta name="generator" content="Hexo 5.4.0"></head><body><div id="loading-box"><div class="loading-left-bg"></div><div class="loading-right-bg"></div><div class="spinner-box"><div class="configure-border-1"><div class="configure-core"></div></div><div class="configure-border-2"><div class="configure-core"></div></div><div class="loading-word">加载中...</div></div></div><div id="sidebar"><div id="menu-mask"></div><div id="sidebar-menus"><div class="avatar-img is-center"><img src="https://img-blog.csdnimg.cn/cfe4091550f44898800da7f9e339e54d.jpg?x-oss-process=image/watermark,type_ZHJvaWRzYW5zZmFsbGJhY2s,shadow_50,text_Q1NETiBAV2hpdGViaXJkXw==,size_19,color_FFFFFF,t_70,g_se,x_16#pic_center" onerror="onerror=null;src='/img/friend_404.gif'" alt="avatar"/></div><div class="site-data"><div class="data-item is-center"><div class="data-item-link"><a href="/archives/"><div class="headline">文章</div><div class="length-num">7</div></a></div></div><div class="data-item is-center"><div class="data-item-link"><a href="/tags/"><div class="headline">标签</div><div class="length-num">1</div></a></div></div><div class="data-item is-center"><div class="data-item-link"><a href="/categories/"><div class="headline">分类</div><div class="length-num">1</div></a></div></div></div><hr/><div class="menus_items"><div class="menus_item"><a class="site-page" href="/"><i class="fa-fw fas fa-home"></i><span> Home</span></a></div><div class="menus_item"><a class="site-page" href="/archives/"><i class="fa-fw fas fa-archive"></i><span> Archives</span></a></div><div class="menus_item"><a class="site-page" href="/categories/"><i class="fa-fw fas fa-folder-open"></i><span> Categories</span></a></div><div class="menus_item"><a class="site-page" href="/link/"><i class="fa-fw fas fa-link"></i><span> Link</span></a></div><div class="menus_item"><a class="site-page" href="/about/"><i class="fa-fw fas fa-heart"></i><span> About</span></a></div></div></div></div><div class="post" id="body-wrap"><header class="post-bg" id="page-header" style="background-image: url('https://img-blog.csdnimg.cn/ef024c421e8e459fb166cbbd1f3046d7.png?x-oss-process=image/watermark,type_ZHJvaWRzYW5zZmFsbGJhY2s,shadow_50,text_Q1NETiBAV2hpdGViaXJkXw==,size_20,color_FFFFFF,t_70,g_se,x_16#pic_center')"><nav id="nav"><span id="blog_name"><a id="site-name" href="/">Whitebird's Home</a></span><div id="menus"><div class="menus_items"><div class="menus_item"><a class="site-page" href="/"><i class="fa-fw fas fa-home"></i><span> Home</span></a></div><div class="menus_item"><a class="site-page" href="/archives/"><i class="fa-fw fas fa-archive"></i><span> Archives</span></a></div><div class="menus_item"><a class="site-page" href="/categories/"><i class="fa-fw fas fa-folder-open"></i><span> Categories</span></a></div><div class="menus_item"><a class="site-page" href="/link/"><i class="fa-fw fas fa-link"></i><span> Link</span></a></div><div class="menus_item"><a class="site-page" href="/about/"><i class="fa-fw fas fa-heart"></i><span> About</span></a></div></div><div id="toggle-menu"><a class="site-page"><i class="fas fa-bars fa-fw"></i></a></div></div></nav><div id="post-info"><h1 class="post-title">逆向工程核心原理——反调试技术</h1><div id="post-meta"><div class="meta-firstline"><span class="post-meta-date"><i class="far fa-calendar-alt fa-fw post-meta-icon"></i><span class="post-meta-label">发表于</span><time class="post-meta-date-created" datetime="2022-03-28T02:30:21.000Z" title="发表于 2022-03-28 10:30:21">2022-03-28</time><span class="post-meta-separator">|</span><i class="fas fa-history fa-fw post-meta-icon"></i><span class="post-meta-label">更新于</span><time class="post-meta-date-updated" datetime="2022-03-28T09:54:49.013Z" title="更新于 2022-03-28 17:54:49">2022-03-28</time></span><span class="post-meta-categories"><span class="post-meta-separator">|</span><i class="fas fa-inbox fa-fw post-meta-icon"></i><a class="post-meta-categories" href="/categories/Reverse/">Reverse</a></span></div><div class="meta-secondline"><span class="post-meta-separator">|</span><span class="post-meta-wordcount"><i class="far fa-file-word fa-fw post-meta-icon"></i><span class="post-meta-label">字数总计:</span><span class="word-count">7k</span><span class="post-meta-separator">|</span><i class="far fa-clock fa-fw post-meta-icon"></i><span class="post-meta-label">阅读时长:</span><span>25分钟</span></span><span class="post-meta-separator">|</span><span class="post-meta-pv-cv" id="" data-flag-title="逆向工程核心原理——反调试技术"><i class="far fa-eye fa-fw post-meta-icon"></i><span class="post-meta-label">阅读量:</span><span id="busuanzi_value_page_pv"></span></span></div></div></div></header><main class="layout" id="content-inner"><div id="post"><article class="post-content" id="article-container"><h1 id="反调试技术的分类"><a href="#反调试技术的分类" class="headerlink" title="反调试技术的分类"></a>反调试技术的分类</h1><p>反调试技术多种多样，大体上可以分成静态与动态两组反调试。调试运用了静态技术的程序文件时只要在开始破解一次就可以解除全部反调试限制，但运用了动态技术的程序则需要一边调试一边破解。</p>
<h2 id="静态反调试技术"><a href="#静态反调试技术" class="headerlink" title="静态反调试技术"></a>静态反调试技术</h2><p>主要用来探测调试器，如果探测到，则使程序无法正常运行。所以一般在调试器中打开应用了静态反调试技术的文件时，文件将无法正常运行。</p>
<h3 id="PEB"><a href="#PEB" class="headerlink" title="PEB"></a>PEB</h3><p>利用PEB结构体信息可以判断当前进程是否处于被调试状态。这些信息值得信赖、使用方便，所以被广泛应用于反调试技术，</p>
<pre class="line-numbers language-none"><code class="language-none">+0x000 InheritedAddressSpace : UChar
 +0x001 ReadImageFileExecOptions : UChar
 +0x002 BeingDebugged    : UChar
 +0x003 SpareBool        : UChar
 +0x004 Mutant           : Ptr32 Void
 +0x008 ImageBaseAddress : Ptr32 Void
 +0x00c Ldr              : Ptr32 _PEB_LDR_DATA
 +0x010 ProcessParameters : Ptr32 _RTL_USER_PROCESS_PARAMETERS
 +0x014 SubSystemData    : Ptr32 Void
 +0x018 ProcessHeap      : Ptr32 Void
 +0x01c FastPebLock      : Ptr32 _RTL_CRITICAL_SECTION
 +0x020 FastPebLockRoutine : Ptr32 Void
 +0x024 FastPebUnlockRoutine : Ptr32 Void
 +0x028 EnvironmentUpdateCount : Uint4B
 +0x02c KernelCallbackTable : Ptr32 Void
 +0x030 SystemReserved   : [1] Uint4B
 +0x034 AtlThunkSListPtr32 : Uint4B
 +0x038 FreeList         : Ptr32 _PEB_FREE_BLOCK
 +0x03c TlsExpansionCounter : Uint4B
 +0x040 TlsBitmap        : Ptr32 Void
 +0x044 TlsBitmapBits    : [2] Uint4B
 +0x04c ReadOnlySharedMemoryBase : Ptr32 Void
 +0x050 ReadOnlySharedMemoryHeap : Ptr32 Void
 +0x054 ReadOnlyStaticServerData : Ptr32 Ptr32 Void
 +0x058 AnsiCodePageData : Ptr32 Void
 +0x05c OemCodePageData  : Ptr32 Void
 +0x060 UnicodeCaseTableData : Ptr32 Void
 +0x064 NumberOfProcessors : Uint4B
 +0x068 NtGlobalFlag     : Uint4B
 +0x070 CriticalSectionTimeout : _LARGE_INTEGER
 +0x078 HeapSegmentReserve : Uint4B
 +0x07c HeapSegmentCommit : Uint4B
 +0x080 HeapDeCommitTotalFreeThreshold : Uint4B
 +0x084 HeapDeCommitFreeBlockThreshold : Uint4B
 +0x088 NumberOfHeaps    : Uint4B
 +0x08c MaximumNumberOfHeaps : Uint4B
 +0x090 ProcessHeaps     : Ptr32 Ptr32 Void
 +0x094 GdiSharedHandleTable : Ptr32 Void
 +0x098 ProcessStarterHelper : Ptr32 Void
 +0x09c GdiDCAttributeList : Uint4B
 +0x0a0 LoaderLock       : Ptr32 Void
 +0x0a4 OSMajorVersion   : Uint4B
 +0x0a8 OSMinorVersion   : Uint4B
 +0x0ac OSBuildNumber    : Uint2B
 +0x0ae OSCSDVersion     : Uint2B
 +0x0b0 OSPlatformId     : Uint4B
 +0x0b4 ImageSubsystem   : Uint4B
 +0x0b8 ImageSubsystemMajorVersion : Uint4B
 +0x0bc ImageSubsystemMinorVersion : Uint4B
 +0x0c0 ImageProcessAffinityMask : Uint4B
 +0x0c4 GdiHandleBuffer  : [34] Uint4B
 +0x14c PostProcessInitRoutine : Ptr32     void 
 +0x150 TlsExpansionBitmap : Ptr32 Void
 +0x154 TlsExpansionBitmapBits : [32] Uint4B
 +0x1d4 SessionId        : Uint4B
 +0x1d8 AppCompatFlags   : _ULARGE_INTEGER
 +0x1e0 AppCompatFlagsUser : _ULARGE_INTEGER
 +0x1e8 pShimData        : Ptr32 Void
 +0x1ec AppCompatInfo    : Ptr32 Void
 +0x1f0 CSDVersion       : _UNICODE_STRING
 +0x1f8 ActivationContextData : Ptr32 Void
 +0x1fc ProcessAssemblyStorageMap : Ptr32 Void
 +0x200 SystemDefaultActivationContextData : Ptr32 Void
 +0x204 SystemAssemblyStorageMap : Ptr32 Void
 +0x208 MinimumStackCommit : Uint4B<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

